Tekla Open API Reference for Tekla Structures 2025
Picker.PickLine Method (String)
 Queries the user to pick a line from the model with the given prompt.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList PickLine(
	string Prompt
)
Public Function PickLine (
	Prompt As String
) As ArrayList
Parameters
Prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: ArrayList
A list of points the user picked.
See Also
Reference
Picker Class
PickLine Overload
Tekla.Structures.Model.UI Namespace